dohcmpst/ujinrobot/Document/FW_Booter/STM32F205RC-Booter-20231006-Ver110/STM32F205RC-Booter/Source/ARMCM3_STM32F2/can.c
void CanTransmitPacket_StdId(blt_int8u *data, blt_int8u len)
{
  blt_int32u txMsgId = BOOT_COM_CAN_TX_MSG_ID;      // #define BOOT_COM_CAN_TX_MSG_ID          (0x7E1  /*| 0x80000000*/)
  CAN_TxHeaderTypeDef txMsgHeader;
  blt_int32u txMsgMailbox;
  blt_int32u timeout;
  HAL_StatusTypeDef txStatus;

  /* configure the message that should be transmitted. */
  /* set the 11-bit CAN identifier. */
  txMsgHeader.StdId = txMsgId;
  txMsgHeader.IDE = CAN_ID_STD;
  txMsgHeader.RTR = CAN_RTR_DATA;
  txMsgHeader.DLC = len;

  /* submit the message for transmission. */
  txStatus = HAL_CAN_AddTxMessage(&canHandle, &txMsgHeader, data,
                                  (uint32_t *)&txMsgMailbox);
  if (txStatus == HAL_OK)
  {
    /* determine timeout time for the transmit completion. */
    timeout = TimerGet() + CAN_MSG_TX_TIMEOUT_MS;
    /* poll for completion of the transmit operation. */
    while (HAL_CAN_IsTxMessagePending(&canHandle, txMsgMailbox) != 0)
    {
      /* service the watchdog. */
      CopService();
      /* break loop upon timeout. this would indicate a hardware failure or no other
       * nodes connected to the bus.
       */
      if (TimerGet() > timeout)
      {
        break;
      }
    }
  }
} /*** end of CanTransmitPacket ***/

void CanTransmitPacket_ExtId(blt_int8u *data, blt_int8u len)
{
  blt_int32u txMsgId = BOOT_COM_CAN_TX_MSG_ID;      // #define BOOT_COM_CAN_TX_MSG_ID          (0x7E1  /*| 0x80000000*/)
  CAN_TxHeaderTypeDef txMsgHeader;
  blt_int32u txMsgMailbox;
  blt_int32u timeout;
  HAL_StatusTypeDef txStatus;

  /* configure the message that should be transmitted. */
  /* set the 29-bit CAN identifier. */
  txMsgHeader.ExtId = txMsgId;
  txMsgHeader.IDE = CAN_ID_EXT;
  txMsgHeader.RTR = CAN_RTR_DATA;
  txMsgHeader.DLC = len;

  /* submit the message for transmission. */
  txStatus = HAL_CAN_AddTxMessage(&canHandle, &txMsgHeader, data,
                                  (uint32_t *)&txMsgMailbox);
  if (txStatus == HAL_OK)
  {
    /* determine timeout time for the transmit completion. */
    timeout = TimerGet() + CAN_MSG_TX_TIMEOUT_MS;
    /* poll for completion of the transmit operation. */
    while (HAL_CAN_IsTxMessagePending(&canHandle, txMsgMailbox) != 0)
    {
      /* service the watchdog. */
      CopService();
      /* break loop upon timeout. this would indicate a hardware failure or no other
       * nodes connected to the bus.
       */
      if (TimerGet() > timeout)
      {
        break;
      }
    }
  }
} /*** end of CanTransmitPacket ***/



/************************************************************************************//**
** \brief     Receives a communication interface packet if one is present.
** \param     data Pointer to byte array where the data is to be stored.
** \param     len Pointer where the length of the packet is to be stored.
** \return    BLT_TRUE is a packet was received, BLT_FALSE otherwise.
**
****************************************************************************************/

blt_bool CanReceivePacket(blt_int8u *data, blt_int8u *len)
{
    blt_int32u rxMsgId = BOOT_COM_CAN_RX_MSG_ID;
    blt_bool result = BLT_FALSE;
    CAN_RxHeaderTypeDef rxMsgHeader;
    HAL_StatusTypeDef canRdFlag;
    static blt_int32u disCnt = 0;
    
    canRdFlag = HAL_CAN_GetRxMessage(&canHandle, CAN_RX_FIFO0, &rxMsgHeader, data);

    //if (HAL_CAN_GetRxMessage(&canHandle, CAN_RX_FIFO0, &rxMsgHeader, data) == HAL_OK)
    if (canRdFlag == HAL_OK)
    {
        /* check if this message has the configured CAN packet identifier. */    
        #if 1
        /* was an 11-bit CAN message received that matches? */
        if ( (rxMsgHeader.StdId == rxMsgId) && (rxMsgHeader.IDE == CAN_ID_STD) )
        {
            /* set flag that a packet with a matching CAN identifier was received. */
            result = BLT_TRUE;
            void Test_FFF(blt_int8u data);
            LL_GPIO_ResetOutputPin(GPIOC, LL_GPIO_PIN_8);   // RS485 - TX
            if ( !(++disCnt % 20)) Test_FFF('.');
        }
        else
        {
            /* was an 29-bit CAN message received that matches? */
            if ( (rxMsgHeader.ExtId == rxMsgId) && (rxMsgHeader.IDE == CAN_ID_EXT) )
            {
                /* set flag that a packet with a matching CAN identifier was received. */
                result = BLT_TRUE;
                void Test_FFF(blt_int8u data);
                LL_GPIO_ResetOutputPin(GPIOC, LL_GPIO_PIN_8);   // RS485 - TX
                if ( !(++disCnt % 20)) Test_FFF('`');
            }       
        }
        #endif
        
        /* store the data length. */
        if (result == BLT_TRUE)
        {
            *len = rxMsgHeader.DLC;
        }
    }
    
    /* Give the result back to the caller. */
    return result;
    
} /*** end of CanReceivePacket ***/



#if 0
blt_bool CanReceivePacket(blt_int8u *data, blt_int8u *len)
{
    blt_int32u rxMsgId = BOOT_COM_CAN_RX_MSG_ID;
    blt_bool result = BLT_FALSE;
    CAN_RxHeaderTypeDef rxMsgHeader;
    
    if (HAL_CAN_GetRxMessage(&canHandle, CAN_RX_FIFO0, &rxMsgHeader, data) == HAL_OK)
    { 
        /* check if this message has the configured CAN packet identifier. */    

        /* was an 11-bit CAN message received that matches? */
        if ( (rxMsgHeader.StdId == rxMsgId) &&
           (rxMsgHeader.IDE == CAN_ID_STD) )
        {
            /* set flag that a packet with a matching CAN identifier was received. */
            result = BLT_TRUE;
        }
        else
        {
            /* was an 29-bit CAN message received that matches? */
            if ( (rxMsgHeader.ExtId == rxMsgId) &&
             (rxMsgHeader.IDE == CAN_ID_EXT) )
            {
                /* set flag that a packet with a matching CAN identifier was received. */
                result = BLT_TRUE;
            }       
        }
        
        /* store the data length. */
        if (result == BLT_TRUE)
        {
            *len = rxMsgHeader.DLC;
        }
    }
    
    /* Give the result back to the caller. */
    return result;
    
} /*** end of CanReceivePacket ***/
#endif

#endif /* BOOT_COM_CAN_ENABLE > 0 */


/*********************************** end of can.c **************************************/
